##树
##含以下方法：

## 树-前序遍历法更新id
## 树-根据id获取该节点
## 树-根据id获取值
## 树-根据id获取子节点
## 树-判断该id的节点是否在树中
## 树-判断该id_1的父系节点是否为id_2节点
## 树-判断该id_1的祖先节点是否为id_2节点
## 树-节点添加
## 树-节点修改
## 树-节点移除

##树定义：
# {
#     id:0,
#     value:0,
#     node:[]
# }

##例子：树含树
# {
#     id:0,
#     value:0,
#     node:[
#         {
#         id:1,
#             value:11,
#             node:[
#                     {
#                         id:2,
#                         value:12d,
#                         node:[]
#                     }
#             ]
#         },
#         {
#         id:3,
#             value:3.2d,
#             node:[]
#         }
#     ]
# }